## production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 11 to add, 4 to change, 5 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                |
|----------|--------------------------------------------------------------------|
| recreate | `aws_acm_certificate.client_vpn`                                   |
| add      | `aws_iam_role.admin`                                               |
|          | `aws_iam_role.document_download`                                   |
|          | `aws_iam_role_policy_attachment.admin_worker`                      |
|          | `aws_iam_role_policy_attachment.document_download_worker`          |
|          | `aws_iam_role_policy_attachment.parameters_csi_admin`              |
|          | `aws_iam_role_policy_attachment.parameters_csi_document_download`  |
|          | `aws_iam_role_policy_attachment.secrets_csi_admin`                 |
|          | `aws_iam_role_policy_attachment.secrets_csi_document_download`     |
|          | `tls_private_key.client_vpn`                                       |
|          | `tls_self_signed_cert.client_vpn`                                  |
| delete   | `aws_acmpca_certificate.client_vpn`                                |
|          | `aws_acmpca_certificate_authority.client_vpn`                      |
|          | `aws_acmpca_certificate_authority_certificate.client_vpn`          |
|          | `time_sleep.wait_for_cert_authority`                               |
| update   | `aws_cloudwatch_dashboard.notify_system[0]`                        |
|          | `module.gha_vpn.aws_ec2_client_vpn_endpoint.this`                  |
|          | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder` |
|          | `module.vpn.aws_ec2_client_vpn_endpoint.this`                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.client_vpn must be replaced
+/- resource "aws_acm_certificate" "client_vpn" {
      ~ arn                       = "arn:aws:acm:ca-central-1:296255494825:certificate/bbc10621-fa72-4352-b3d1-b39db9627176" -> (known after apply)
      - certificate_authority_arn = "arn:aws:acm-pca:ca-central-1:296255494825:certificate-authority/2f4f3dad-e9aa-4bae-827c-6e91fc938f5b" -> null # forces replacement
      + certificate_body          = (known after apply)
      ~ domain_name               = "production.notification.canada.ca" -> (known after apply)
      ~ domain_validation_options = [] -> (known after apply)
      ~ id                        = "arn:aws:acm:ca-central-1:296255494825:certificate/bbc10621-fa72-4352-b3d1-b39db9627176" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2025-10-12T12:45:56Z" -> (known after apply)
      ~ not_before                = "2024-09-12T11:45:56Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      + private_key               = (sensitive value)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [
          - "production.notification.canada.ca",
        ] -> (known after apply)
      ~ tags                      = {
          + "CostCenter"  = "notification-canada-ca-production"
          - "Environment" = "production" -> null
          + "Name"        = "notification-canada-ca"
        }
      ~ tags_all                  = {
          + "CostCenter"  = "notification-canada-ca-production"
          - "Environment" = "production" -> null
          + "Name"        = "notification-canada-ca"
        }
      ~ type                      = "PRIVATE" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
      ~ validation_method         = "NONE" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ options {
          + arn                       = (known after apply)
          + certificate_authority_arn = (known after apply)
          + certificate_body          = (known after apply)
          + certificate_chain         = (known after apply)
          + domain_name               = (known after apply)
          + domain_validation_options = (known after apply)
          + early_renewal_duration    = (known after apply)
          + id                        = (known after apply)
          + key_algorithm             = (known after apply)
          + not_after                 = (known after apply)
          + not_before                = (known after apply)
          + pending_renewal           = (known after apply)
          + private_key               = (known after apply)
          + renewal_eligibility       = (known after apply)
          + renewal_summary           = (known after apply)
          + status                    = (known after apply)
          + subject_alternative_names = (known after apply)
          + tags                      = (known after apply)
          + tags_all                  = (known after apply)
          + type                      = (known after apply)
          + validation_emails         = (known after apply)
          + validation_method         = (known after apply)
        } -> (known after apply)
    }

  # aws_acmpca_certificate.client_vpn will be destroyed
  # (because aws_acmpca_certificate.client_vpn is not in configuration)
  - resource "aws_acmpca_certificate" "client_vpn" {
      - arn                         = "arn:aws:acm-pca:ca-central-1:296255494825:certificate-authority/2f4f3dad-e9aa-4bae-827c-6e91fc938f5b/certificate/d024e77e04141cf0a9c561e5328255c4" -> null
      - certificate                 = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFDzCCAvegAwIBAgIRANAk534EFBzwqcVh5TKCVcQwDQYJKoZIhvcNAQENBQAw
            ITEfMB0GA1UEAwwWbm90aWZpY2F0aW9uLmNhbmFkYS5jYTAeFw0yNDA5MTIxMTQ1
            NTRaFw0yOTA5MTIxMjQ1NTRaMCExHzAdBgNVBAMMFm5vdGlmaWNhdGlvbi5jYW5h
            ZGEuY2EwggIiMA0GCSqGSIb3DQEBAQUAA4ICDwAwggIKAoICAQC6RQ285u0U+XYq
            bYSNsKWCCHS6EuGMAABwVSX4hFmwtS86iPUVGbRgdqeLTmmEWq8eTF3WKWMsFMNr
            eJx+x/y+KzArGzODGC2asLUJ1yKPcrGhD0EhRqHTCOeqtZ+aukEm5BzSd6OU/wkG
            vi9jR5aO9QTtVU3lne2AQLamR8N5vod/xEn71mqVxTB5ctx1cPoORoQsEo8TdN42
            mJw+JR7QGXZcsi5Z91yJQBxZkTwk/54LH27v5uML8drCeEuvWyCp/lBjoCLfBd+e
            lUYqPxFIOLepW7kHJBWfRkUVyIk7IoIpBvquW3oxTd0SrCHlspbxwC7y0gkfXWMC
            5dX1cM4UdH3psCRCz0BbHdpruEV+7TaLEGI7LynoZt/5cmAUjrq/0uSAV5EiRqcN
            2NRzqi2JHxO6H+0vcL5VTclbKFLo9IvGAFZ57MUTg/gcg80yOGlSvPt3X+oMd8qP
            rpnR9yUCHoWbR9/dxQD0Pco9nkXSD6ZaBXU8zjYHTD9VZrXZFOPpAPSqxSKJLZtR
            8RCud2OLwveAT7/XqcrO8Fpp1Q2kTQ9ixdTMhRSBqIH3E5TdbSpNkbEMPYkxPLMT
            uP3T9BLKtgkcBstbtWUuiLAJoP5cP7JDQejxQQjrfRYZ0UZt4p/7sM5Dzhj2gp/f
            CRDz3ipGOLHpU9SBXvCx7v/w9DqIfQIDAQABo0IwQDAPBgNVHRMBAf8EBTADAQH/
            MB0GA1UdDgQWBBQRa0vR63psdxHqPVOiMo4OsWFWXDAOBgNVHQ8BAf8EBAMCAYYw
            DQYJKoZIhvcNAQENBQADggIBAI72yWfC7w7cpuW6rOjfTZnDoMdbmWI5ILACHI1z
            FjZNq+BtUt6jeUinj3KGaMz0+yJYue4QKg9Ybul/ub+raTeON0Peyo38+LDTj4+b
            0OSnzMiFm0Qb2rWH0f2IOYe+Jmd5t3uddVRLGBIz2pQQUp79+x22Jvj2SNOSXmDF
            pio34Hi9ClYtUC2LuGfFRMZlcy14X3+jGFyVvDUzWKGsPvgRqdnoEJEPQlBy/SXk
            4lnbbbOO9qpQcyaLh/8ClvJdG5aFefyileeXkHliRqZxShZhnUkY2YRCas4bsaWv
            rXUwGYNudlxOWFHeiVL+ZEiRtPWDWae46ZKOJhKuDm3Is+VZDcY0E9ee4URlGnIR
            bRSZ+i/kmFC/80uAaandZ8KFBSZb1/WNcp5HjQEgRRpyckPZStcncVDIDV+Zbr8H
            x2KcSOiOiBzEpCTHkR2o2tCDLOOfbCYK6ALJFiF7I2MUk4jqPhVudivmE3QcQrZi
            omXYqqWtCuNjhTM/QpaIruuW3vOty6fqcETcIBP8uOv+oIvKcXYzPZkg21pIKb8Z
            5RffjtVIE0rEX865waEf/vF/vBTJI77E1F71pnoDWJXcXX2YNEPHTD1ZrUcd9fVG
            r3Jb+sbF3QBu2/bBj5D6X7L3f3OHX10Up0m+SSpK/RmO2Uk+dRbJEIeTX/osOYQK
            sC/1
            -----END CERTIFICATE-----
        EOT -> null
      - certificate_authority_arn   = "arn:aws:acm-pca:ca-central-1:296255494825:certificate-authority/2f4f3dad-e9aa-4bae-827c-6e91fc938f5b" -> null
      - certificate_signing_request = <<-EOT
            -----BEGIN CERTIFICATE REQUEST-----
            MIIEiDCCAnACAQAwITEfMB0GA1UEAwwWbm90aWZpY2F0aW9uLmNhbmFkYS5jYTCC
            AiIwDQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBALpFDbzm7RT5dipthI2wpYII
            dLoS4YwAAHBVJfiEWbC1LzqI9RUZtGB2p4tOaYRarx5MXdYpYywUw2t4nH7H/L4r
            MCsbM4MYLZqwtQnXIo9ysaEPQSFGodMI56q1n5q6QSbkHNJ3o5T/CQa+L2NHlo71
            BO1VTeWd7YBAtqZHw3m+h3/ESfvWapXFMHly3HVw+g5GhCwSjxN03jaYnD4lHtAZ
            dlyyLln3XIlAHFmRPCT/ngsfbu/m4wvx2sJ4S69bIKn+UGOgIt8F356VRio/EUg4
            t6lbuQckFZ9GRRXIiTsigikG+q5bejFN3RKsIeWylvHALvLSCR9dYwLl1fVwzhR0
            femwJELPQFsd2mu4RX7tNosQYjsvKehm3/lyYBSOur/S5IBXkSJGpw3Y1HOqLYkf
            E7of7S9wvlVNyVsoUuj0i8YAVnnsxROD+ByDzTI4aVK8+3df6gx3yo+umdH3JQIe
            hZtH393FAPQ9yj2eRdIPploFdTzONgdMP1VmtdkU4+kA9KrFIoktm1HxEK53Y4vC
            94BPv9epys7wWmnVDaRND2LF1MyFFIGogfcTlN1tKk2RsQw9iTE8sxO4/dP0Esq2
            CRwGy1u1ZS6IsAmg/lw/skNB6PFBCOt9FhnRRm3in/uwzkPOGPaCn98JEPPeKkY4
            selT1IFe8LHu//D0Ooh9AgMBAAGgIjAgBgkqhkiG9w0BCQ4xEzARMA8GA1UdEwEB
            /wQFMAMBAf8wDQYJKoZIhvcNAQENBQADggIBABz3N4fYPRB41hO0LOyrn3D4rIN1
            aNGNrXWHJ51a+Qi9oH9Zc5BLjPDZajdRmmXfbBiwBc1zEQ1aZuuXEoHN0A9nvZXR
            hDeu6bcruWT67kQerB0BJTeih9UuTF5V1+x5CqZIKPl2UfK1p2l9WKwnpmzmq3OK
            sQLHmCPBqxHiYunYGT/2KRxu7WyJoVdWK220+ZLTVeNdVEgwkSqYimkvqN73VzgE
            r/6E8KEzvlWodgnfYMR6BbQ/1q49Z3E5OZUI5B7hOGAPsqPn5/hV6deK3UNoWd7T
            6p9DMLc99pyhxdBl/OVPCvaULgHJIYcaTIOoIEib06tGWcLfKOY/1Z6HCME0HDw6
            lBGOyJ0cfTxoaGIN/f/+YwP0Zyrpo2csfmzKjKWxe+Wq/Jhs+jxz9eB/XUkxmb8W
            AeTJmV9YSVuKvBAJQ4mj7+SfPkY4bgFyeJs5vD9OjCmDmF/Ha9CBm8/AGRXsTwY0
            Wynifx9IU/t6bVcnQUwtxD85gnQyoWD1Ms2JpUd5EonwQAeCS8Qy5uk7j/d826t1
            QWa3f4wIt/3gwnI74kpmNRhYBQvtq+dk1kb7c68fn/rffAq/7xnd1SY3eVWIevfh
            ye76lkwGLXAXujAXPRSGC713JLpPXpeP2Kg2Am4TjDql0/9huOXteW0vGx6JVGXQ
            FNi7lssCu8mb1SgX
            -----END CERTIFICATE REQUEST-----
        EOT -> null
      - id                          = "arn:aws:acm-pca:ca-central-1:296255494825:certificate-authority/2f4f3dad-e9aa-4bae-827c-6e91fc938f5b/certificate/d024e77e04141cf0a9c561e5328255c4" -> null
      - signing_algorithm           = "SHA512WITHRSA" -> null
      - template_arn                = "arn:aws:acm-pca:::template/RootCACertificate/V1" -> null
        # (1 unchanged attribute hidden)

      - validity {
          - type  = "YEARS" -> null
          - value = "5" -> null
        }
    }

  # aws_acmpca_certificate_authority.client_vpn will be destroyed
  # (because aws_acmpca_certificate_authority.client_vpn is not in configuration)
  - resource "aws_acmpca_certificate_authority" "client_vpn" {
      - arn                             = "arn:aws:acm-pca:ca-central-1:296255494825:certificate-authority/2f4f3dad-e9aa-4bae-827c-6e91fc938f5b" -> null
      - certificate                     = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFDzCCAvegAwIBAgIRANAk534EFBzwqcVh5TKCVcQwDQYJKoZIhvcNAQENBQAw
            ITEfMB0GA1UEAwwWbm90aWZpY2F0aW9uLmNhbmFkYS5jYTAeFw0yNDA5MTIxMTQ1
            NTRaFw0yOTA5MTIxMjQ1NTRaMCExHzAdBgNVBAMMFm5vdGlmaWNhdGlvbi5jYW5h
            ZGEuY2EwggIiMA0GCSqGSIb3DQEBAQUAA4ICDwAwggIKAoICAQC6RQ285u0U+XYq
            bYSNsKWCCHS6EuGMAABwVSX4hFmwtS86iPUVGbRgdqeLTmmEWq8eTF3WKWMsFMNr
            eJx+x/y+KzArGzODGC2asLUJ1yKPcrGhD0EhRqHTCOeqtZ+aukEm5BzSd6OU/wkG
            vi9jR5aO9QTtVU3lne2AQLamR8N5vod/xEn71mqVxTB5ctx1cPoORoQsEo8TdN42
            mJw+JR7QGXZcsi5Z91yJQBxZkTwk/54LH27v5uML8drCeEuvWyCp/lBjoCLfBd+e
            lUYqPxFIOLepW7kHJBWfRkUVyIk7IoIpBvquW3oxTd0SrCHlspbxwC7y0gkfXWMC
            5dX1cM4UdH3psCRCz0BbHdpruEV+7TaLEGI7LynoZt/5cmAUjrq/0uSAV5EiRqcN
            2NRzqi2JHxO6H+0vcL5VTclbKFLo9IvGAFZ57MUTg/gcg80yOGlSvPt3X+oMd8qP
            rpnR9yUCHoWbR9/dxQD0Pco9nkXSD6ZaBXU8zjYHTD9VZrXZFOPpAPSqxSKJLZtR
            8RCud2OLwveAT7/XqcrO8Fpp1Q2kTQ9ixdTMhRSBqIH3E5TdbSpNkbEMPYkxPLMT
            uP3T9BLKtgkcBstbtWUuiLAJoP5cP7JDQejxQQjrfRYZ0UZt4p/7sM5Dzhj2gp/f
            CRDz3ipGOLHpU9SBXvCx7v/w9DqIfQIDAQABo0IwQDAPBgNVHRMBAf8EBTADAQH/
            MB0GA1UdDgQWBBQRa0vR63psdxHqPVOiMo4OsWFWXDAOBgNVHQ8BAf8EBAMCAYYw
            DQYJKoZIhvcNAQENBQADggIBAI72yWfC7w7cpuW6rOjfTZnDoMdbmWI5ILACHI1z
            FjZNq+BtUt6jeUinj3KGaMz0+yJYue4QKg9Ybul/ub+raTeON0Peyo38+LDTj4+b
            0OSnzMiFm0Qb2rWH0f2IOYe+Jmd5t3uddVRLGBIz2pQQUp79+x22Jvj2SNOSXmDF
            pio34Hi9ClYtUC2LuGfFRMZlcy14X3+jGFyVvDUzWKGsPvgRqdnoEJEPQlBy/SXk
            4lnbbbOO9qpQcyaLh/8ClvJdG5aFefyileeXkHliRqZxShZhnUkY2YRCas4bsaWv
            rXUwGYNudlxOWFHeiVL+ZEiRtPWDWae46ZKOJhKuDm3Is+VZDcY0E9ee4URlGnIR
            bRSZ+i/kmFC/80uAaandZ8KFBSZb1/WNcp5HjQEgRRpyckPZStcncVDIDV+Zbr8H
            x2KcSOiOiBzEpCTHkR2o2tCDLOOfbCYK6ALJFiF7I2MUk4jqPhVudivmE3QcQrZi
            omXYqqWtCuNjhTM/QpaIruuW3vOty6fqcETcIBP8uOv+oIvKcXYzPZkg21pIKb8Z
            5RffjtVIE0rEX865waEf/vF/vBTJI77E1F71pnoDWJXcXX2YNEPHTD1ZrUcd9fVG
            r3Jb+sbF3QBu2/bBj5D6X7L3f3OHX10Up0m+SSpK/RmO2Uk+dRbJEIeTX/osOYQK
            sC/1
            -----END CERTIFICATE-----
        EOT -> null
      - certificate_signing_request     = <<-EOT
            -----BEGIN CERTIFICATE REQUEST-----
            MIIEiDCCAnACAQAwITEfMB0GA1UEAwwWbm90aWZpY2F0aW9uLmNhbmFkYS5jYTCC
            AiIwDQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBALpFDbzm7RT5dipthI2wpYII
            dLoS4YwAAHBVJfiEWbC1LzqI9RUZtGB2p4tOaYRarx5MXdYpYywUw2t4nH7H/L4r
            MCsbM4MYLZqwtQnXIo9ysaEPQSFGodMI56q1n5q6QSbkHNJ3o5T/CQa+L2NHlo71
            BO1VTeWd7YBAtqZHw3m+h3/ESfvWapXFMHly3HVw+g5GhCwSjxN03jaYnD4lHtAZ
            dlyyLln3XIlAHFmRPCT/ngsfbu/m4wvx2sJ4S69bIKn+UGOgIt8F356VRio/EUg4
            t6lbuQckFZ9GRRXIiTsigikG+q5bejFN3RKsIeWylvHALvLSCR9dYwLl1fVwzhR0
            femwJELPQFsd2mu4RX7tNosQYjsvKehm3/lyYBSOur/S5IBXkSJGpw3Y1HOqLYkf
            E7of7S9wvlVNyVsoUuj0i8YAVnnsxROD+ByDzTI4aVK8+3df6gx3yo+umdH3JQIe
            hZtH393FAPQ9yj2eRdIPploFdTzONgdMP1VmtdkU4+kA9KrFIoktm1HxEK53Y4vC
            94BPv9epys7wWmnVDaRND2LF1MyFFIGogfcTlN1tKk2RsQw9iTE8sxO4/dP0Esq2
            CRwGy1u1ZS6IsAmg/lw/skNB6PFBCOt9FhnRRm3in/uwzkPOGPaCn98JEPPeKkY4
            selT1IFe8LHu//D0Ooh9AgMBAAGgIjAgBgkqhkiG9w0BCQ4xEzARMA8GA1UdEwEB
            /wQFMAMBAf8wDQYJKoZIhvcNAQENBQADggIBABz3N4fYPRB41hO0LOyrn3D4rIN1
            aNGNrXWHJ51a+Qi9oH9Zc5BLjPDZajdRmmXfbBiwBc1zEQ1aZuuXEoHN0A9nvZXR
            hDeu6bcruWT67kQerB0BJTeih9UuTF5V1+x5CqZIKPl2UfK1p2l9WKwnpmzmq3OK
            sQLHmCPBqxHiYunYGT/2KRxu7WyJoVdWK220+ZLTVeNdVEgwkSqYimkvqN73VzgE
            r/6E8KEzvlWodgnfYMR6BbQ/1q49Z3E5OZUI5B7hOGAPsqPn5/hV6deK3UNoWd7T
            6p9DMLc99pyhxdBl/OVPCvaULgHJIYcaTIOoIEib06tGWcLfKOY/1Z6HCME0HDw6
            lBGOyJ0cfTxoaGIN/f/+YwP0Zyrpo2csfmzKjKWxe+Wq/Jhs+jxz9eB/XUkxmb8W
            AeTJmV9YSVuKvBAJQ4mj7+SfPkY4bgFyeJs5vD9OjCmDmF/Ha9CBm8/AGRXsTwY0
            Wynifx9IU/t6bVcnQUwtxD85gnQyoWD1Ms2JpUd5EonwQAeCS8Qy5uk7j/d826t1
            QWa3f4wIt/3gwnI74kpmNRhYBQvtq+dk1kb7c68fn/rffAq/7xnd1SY3eVWIevfh
            ye76lkwGLXAXujAXPRSGC713JLpPXpeP2Kg2Am4TjDql0/9huOXteW0vGx6JVGXQ
            FNi7lssCu8mb1SgX
            -----END CERTIFICATE REQUEST-----
        EOT -> null
      - enabled                         = true -> null
      - id                              = "arn:aws:acm-pca:ca-central-1:296255494825:certificate-authority/2f4f3dad-e9aa-4bae-827c-6e91fc938f5b" -> null
      - key_storage_security_standard   = "FIPS_140_2_LEVEL_3_OR_HIGHER" -> null
      - not_after                       = "2029-09-12T12:45:54Z" -> null
      - not_before                      = "2024-09-12T11:45:54Z" -> null
      - permanent_deletion_time_in_days = 7 -> null
      - serial                          = "276671041030798930913184497506344654276" -> null
      - tags                            = {} -> null
      - tags_all                        = {} -> null
      - type                            = "ROOT" -> null
      - usage_mode                      = "GENERAL_PURPOSE" -> null
        # (1 unchanged attribute hidden)

      - certificate_authority_configuration {
          - key_algorithm     = "RSA_4096" -> null
          - signing_algorithm = "SHA512WITHRSA" -> null

          - subject {
              - common_name                  = "notification.canada.ca" -> null
                # (12 unchanged attributes hidden)
            }
        }

      - revocation_configuration {
          - crl_configuration {
              - enabled            = false -> null
              - expiration_in_days = 0 -> null
                # (3 unchanged attributes hidden)
            }
          - ocsp_configuration {
              - enabled           = false -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_acmpca_certificate_authority_certificate.client_vpn will be destroyed
  # (because aws_acmpca_certificate_authority_certificate.client_vpn is not in configuration)
  - resource "aws_acmpca_certificate_authority_certificate" "client_vpn" {
      - certificate               = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFDzCCAvegAwIBAgIRANAk534EFBzwqcVh5TKCVcQwDQYJKoZIhvcNAQENBQAw
            ITEfMB0GA1UEAwwWbm90aWZpY2F0aW9uLmNhbmFkYS5jYTAeFw0yNDA5MTIxMTQ1
            NTRaFw0yOTA5MTIxMjQ1NTRaMCExHzAdBgNVBAMMFm5vdGlmaWNhdGlvbi5jYW5h
            ZGEuY2EwggIiMA0GCSqGSIb3DQEBAQUAA4ICDwAwggIKAoICAQC6RQ285u0U+XYq
            bYSNsKWCCHS6EuGMAABwVSX4hFmwtS86iPUVGbRgdqeLTmmEWq8eTF3WKWMsFMNr
            eJx+x/y+KzArGzODGC2asLUJ1yKPcrGhD0EhRqHTCOeqtZ+aukEm5BzSd6OU/wkG
            vi9jR5aO9QTtVU3lne2AQLamR8N5vod/xEn71mqVxTB5ctx1cPoORoQsEo8TdN42
            mJw+JR7QGXZcsi5Z91yJQBxZkTwk/54LH27v5uML8drCeEuvWyCp/lBjoCLfBd+e
            lUYqPxFIOLepW7kHJBWfRkUVyIk7IoIpBvquW3oxTd0SrCHlspbxwC7y0gkfXWMC
            5dX1cM4UdH3psCRCz0BbHdpruEV+7TaLEGI7LynoZt/5cmAUjrq/0uSAV5EiRqcN
            2NRzqi2JHxO6H+0vcL5VTclbKFLo9IvGAFZ57MUTg/gcg80yOGlSvPt3X+oMd8qP
            rpnR9yUCHoWbR9/dxQD0Pco9nkXSD6ZaBXU8zjYHTD9VZrXZFOPpAPSqxSKJLZtR
            8RCud2OLwveAT7/XqcrO8Fpp1Q2kTQ9ixdTMhRSBqIH3E5TdbSpNkbEMPYkxPLMT
            uP3T9BLKtgkcBstbtWUuiLAJoP5cP7JDQejxQQjrfRYZ0UZt4p/7sM5Dzhj2gp/f
            CRDz3ipGOLHpU9SBXvCx7v/w9DqIfQIDAQABo0IwQDAPBgNVHRMBAf8EBTADAQH/
            MB0GA1UdDgQWBBQRa0vR63psdxHqPVOiMo4OsWFWXDAOBgNVHQ8BAf8EBAMCAYYw
            DQYJKoZIhvcNAQENBQADggIBAI72yWfC7w7cpuW6rOjfTZnDoMdbmWI5ILACHI1z
            FjZNq+BtUt6jeUinj3KGaMz0+yJYue4QKg9Ybul/ub+raTeON0Peyo38+LDTj4+b
            0OSnzMiFm0Qb2rWH0f2IOYe+Jmd5t3uddVRLGBIz2pQQUp79+x22Jvj2SNOSXmDF
            pio34Hi9ClYtUC2LuGfFRMZlcy14X3+jGFyVvDUzWKGsPvgRqdnoEJEPQlBy/SXk
            4lnbbbOO9qpQcyaLh/8ClvJdG5aFefyileeXkHliRqZxShZhnUkY2YRCas4bsaWv
            rXUwGYNudlxOWFHeiVL+ZEiRtPWDWae46ZKOJhKuDm3Is+VZDcY0E9ee4URlGnIR
            bRSZ+i/kmFC/80uAaandZ8KFBSZb1/WNcp5HjQEgRRpyckPZStcncVDIDV+Zbr8H
            x2KcSOiOiBzEpCTHkR2o2tCDLOOfbCYK6ALJFiF7I2MUk4jqPhVudivmE3QcQrZi
            omXYqqWtCuNjhTM/QpaIruuW3vOty6fqcETcIBP8uOv+oIvKcXYzPZkg21pIKb8Z
            5RffjtVIE0rEX865waEf/vF/vBTJI77E1F71pnoDWJXcXX2YNEPHTD1ZrUcd9fVG
            r3Jb+sbF3QBu2/bBj5D6X7L3f3OHX10Up0m+SSpK/RmO2Uk+dRbJEIeTX/osOYQK
            sC/1
            -----END CERTIFICATE-----
        EOT -> null
      - certificate_authority_arn = "arn:aws:acm-pca:ca-central-1:296255494825:certificate-authority/2f4f3dad-e9aa-4bae-827c-6e91fc938f5b" -> null
      - id                        = "arn:aws:acm-pca:ca-central-1:296255494825:certificate-authority/2f4f3dad-e9aa-4bae-827c-6e91fc938f5b" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_cloudwatch_dashboard.notify_system[0] will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "notify_system" {
      ~ dashboard_body = (sensitive value)
        id             = "Notify-System-Overview"
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.admin will be created
  + resource "aws_iam_role" "admin" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notify-admin"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "admin-eks-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.document_download will be created
  + resource "aws_iam_role" "document_download" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notify-document-download"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "document-download-eks-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.admin_worker will be created
  + resource "aws_iam_role_policy_attachment" "admin_worker" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/notification-worker-policy"
      + role       = "admin-eks-role"
    }

  # aws_iam_role_policy_attachment.document_download_worker will be created
  + resource "aws_iam_role_policy_attachment" "document_download_worker" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/notification-worker-policy"
      + role       = "document-download-eks-role"
    }

  # aws_iam_role_policy_attachment.parameters_csi_admin will be created
  + resource "aws_iam_role_policy_attachment" "parameters_csi_admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/parameters-csi-policy"
      + role       = "admin-eks-role"
    }

  # aws_iam_role_policy_attachment.parameters_csi_document_download will be created
  + resource "aws_iam_role_policy_attachment" "parameters_csi_document_download" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/parameters-csi-policy"
      + role       = "document-download-eks-role"
    }

  # aws_iam_role_policy_attachment.secrets_csi_admin will be created
  + resource "aws_iam_role_policy_attachment" "secrets_csi_admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/secrets-csi-policy"
      + role       = "admin-eks-role"
    }

  # aws_iam_role_policy_attachment.secrets_csi_document_download will be created
  + resource "aws_iam_role_policy_attachment" "secrets_csi_document_download" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/secrets-csi-policy"
      + role       = "document-download-eks-role"
    }

  # time_sleep.wait_for_cert_authority will be destroyed
  # (because time_sleep.wait_for_cert_authority is not in configuration)
  - resource "time_sleep" "wait_for_cert_authority" {
      - create_duration = "30s" -> null
      - id              = "2024-10-09T16:10:12Z" -> null
    }

  # tls_private_key.client_vpn will be created
  + resource "tls_private_key" "client_vpn" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # tls_self_signed_cert.client_vpn will be created
  + resource "tls_self_signed_cert" "client_vpn" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "server_auth",
          + "ipsec_end_system",
          + "ipsec_tunnel",
          + "any_extended",
          + "cert_signing",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 672
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = true
      + set_subject_key_id    = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 43800
      + validity_start_time   = (known after apply)

      + subject {
          + common_name = "vpn.production.notification.canada.ca"
        }
    }

  # module.gha_vpn.aws_ec2_client_vpn_endpoint.this will be updated in-place
  ~ resource "aws_ec2_client_vpn_endpoint" "this" {
        id                      = "cvpn-endpoint-0dc4cfa6627940641"
      ~ server_certificate_arn  = "arn:aws:acm:ca-central-1:296255494825:certificate/bbc10621-fa72-4352-b3d1-b39db9627176" -> (known after apply)
        tags                    = {
            "CostCentre" = "notification-canada-ca-production"
            "Source"     = "cds-snc/terraform-modules/client_vpn"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "sentinel-cloud-watch-forwarder"
      ~ layers                         = [
          ~ (sensitive value),
        ]
        tags                           = {
            "CostCentre" = "notification-canada-ca-production"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpn.aws_ec2_client_vpn_endpoint.this will be updated in-place
  ~ resource "aws_ec2_client_vpn_endpoint" "this" {
        id                      = "cvpn-endpoint-06ea6bb8a835c6e2a"
      ~ server_certificate_arn  = "arn:aws:acm:ca-central-1:296255494825:certificate/bbc10621-fa72-4352-b3d1-b39db9627176" -> (known after apply)
        tags                    = {
            "CostCentre" = "notification-canada-ca-production"
            "Source"     = "cds-snc/terraform-modules/client_vpn"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 11 to add, 4 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
